src/modules/stripe/__recordings__/stripe-api_748119249/validateStripeKeys_2838756478/should-throw-error-if-publishable-key-is-invalid_3942585802/recording.har

{
  "log": {
    "_recordingName": "stripe-api/validateStripeKeys/should throw error if publishable key is invalid",
    "creator": {
      "comment": "persister:fs",
      "name": "Polly.JS",
      "version": "6.0.5"
    },
    "entries": [
      {
        "_id": "f0b115a56f7869752bc33b5352ad87da",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 0,
          "cookies": [],
          "headers": [
            {
              "name": "accept",
              "value": "application/json"
            },
            {
              "name": "content-type",
              "value": "application/x-www-form-urlencoded"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "user-agent",
              "value": "Stripe/v1 NodeBindings/12.12.0"
            }
          ],
          "headersSize": 727,
          "httpVersion": "HTTP/1.1",
          "method": "GET",
          "queryString": [
            {
              "name": "limit",
              "value": "1"
            }
          ],
          "url": "https://api.stripe.com/v1/payment_intents?limit=1"
        },
        "response": {
          "bodySize": 1691,
          "content": {
            "mimeType": "application/json",
            "size": 1691,
            "text": {
              "data": [
                {
                  "amount": 22299,
                  "amount_capturable": 0,
                  "amount_details": {
                    "tip": {}
                  },
                  "amount_received": 0,
                  "application": null,
                  "application_fee_amount": null,
                  "automatic_payment_methods": null,
                  "canceled_at": null,
                  "cancellation_reason": null,
                  "capture_method": "manual",
                  "client_secret": "pi_3NScK0EosEcNBN5m1WnZ213K_secret_gLHGnl6ElaTd98Hr0LphYoZvY",
                  "confirmation_method": "automatic",
                  "created": 1689065604,
                  "currency": "pln",
                  "customer": null,
                  "description": null,
                  "id": "pi_3NScK0EosEcNBN5m1WnZ213K",
                  "invoice": null,
                  "last_payment_error": null,
                  "latest_charge": null,
                  "livemode": false,
                  "metadata": {
                    "channelId": "1",
                    "checkoutId": "c29tZS1jaGVja291dC1pZA==",
                    "transactionId": "555555"
                  },
                  "next_action": null,
                  "object": "payment_intent",
                  "on_behalf_of": null,
                  "payment_method": null,
                  "payment_method_options": {
                    "card": {
                      "installments": null,
                      "mandate_options": null,
                      "network": null,
                      "request_three_d_secure": "automatic"
                    }
                  },
                  "payment_method_types": [
                    "card"
                  ],
                  "processing": null,
                  "receipt_email": null,
                  "review": null,
                  "setup_future_usage": null,
                  "shipping": null,
                  "source": null,
                  "statement_descriptor": null,
                  "statement_descriptor_suffix": null,
                  "status": "requires_payment_method",
                  "transfer_data": null,
                  "transfer_group": null
                }
              ],
              "has_more": true,
              "object": "list",
              "url": "/v1/payment_intents"
            }
          },
          "cookies": [],
          "headers": [
            {
              "name": "access-control-allow-credentials",
              "value": "true"
            },
            {
              "name": "access-control-allow-methods",
              "value": "GET, POST, HEAD, OPTIONS, DELETE"
            },
            {
              "name": "access-control-allow-origin",
              "value": "*"
            },
            {
              "name": "access-control-expose-headers",
              "value": "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
            },
            {
              "name": "access-control-max-age",
              "value": "300"
            },
            {
              "name": "cache-control",
              "value": "no-cache, no-store"
            },
            {
              "name": "connection",
              "value": "keep-alive"
            },
            {
              "name": "content-length",
              "value": "1691"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "date",
              "value": "Tue, 11 Jul 2023 08:53:25 GMT"
            },
            {
              "name": "request-id",
              "value": "req_2w8OyBVBxuz5KE"
            },
            {
              "name": "server",
              "value": "nginx"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=63072000; includeSubDomains; preload"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "x-stripe-routing-context-priority-tier",
              "value": "api-testmode"
            }
          ],
          "headersSize": 656,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "",
          "status": 200,
          "statusText": "OK"
        },
        "startedDateTime": "2023-07-11T08:53:24.794Z",
        "time": 375,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 375
        }
      },
      {
        "_id": "b23fe4d7e025e7ba7f5d258d9e8f4b0b",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 19,
          "cookies": [],
          "headers": [
            {
              "name": "accept",
              "value": "application/json"
            },
            {
              "name": "content-length",
              "value": "19"
            },
            {
              "name": "content-type",
              "value": "application/x-www-form-urlencoded"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "user-agent",
              "value": "Stripe/v1 NodeBindings/12.12.0"
            }
          ],
          "headersSize": 630,
          "httpVersion": "HTTP/1.1",
          "method": "POST",
          "postData": {
            "mimeType": "application/x-www-form-urlencoded",
            "params": [],
            "text": "pii[id_number]=test"
          },
          "queryString": [],
          "url": "https://api.stripe.com/v1/tokens"
        },
        "response": {
          "bodySize": 108,
          "content": {
            "mimeType": "application/json",
            "size": 108,
            "text": {
              "error": {
                "message": "Invalid API Key provided: blabla",
                "type": "invalid_request_error"
              }
            }
          },
          "cookies": [],
          "headers": [
            {
              "name": "access-control-allow-credentials",
              "value": "true"
            },
            {
              "name": "access-control-allow-methods",
              "value": "GET, POST, HEAD, OPTIONS, DELETE"
            },
            {
              "name": "access-control-allow-origin",
              "value": "*"
            },
            {
              "name": "access-control-expose-headers",
              "value": "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
            },
            {
              "name": "access-control-max-age",
              "value": "300"
            },
            {
              "name": "cache-control",
              "value": "no-cache, no-store"
            },
            {
              "name": "connection",
              "value": "keep-alive"
            },
            {
              "name": "content-length",
              "value": "108"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "date",
              "value": "Tue, 11 Jul 2023 08:53:25 GMT"
            },
            {
              "name": "server",
              "value": "nginx"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=63072000; includeSubDomains; preload"
            },
            {
              "name": "www-authenticate",
              "value": "Bearer realm=\"Stripe\""
            }
          ],
          "headersSize": 582,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "",
          "status": 401,
          "statusText": "Unauthorized"
        },
        "startedDateTime": "2023-07-11T08:53:25.172Z",
        "time": 47,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 47
        }
      }
    ],
    "pages": [],
    "version": "1.2"
  }
}
